# Chapter 11 Pandas Module

In [2]:
# Pandas is a Python library to deal with sequential and tabular data. It in-
# cludes many tools to manage, analyze and manipulate data in a convenient
# and efficient manner. We can think of its data structures as akin to database
# tables or spreadsheets.

In [3]:
# Pandas is built on top of the Numpy library and has two primary data struc-
# tures viz. Series (1-dimensional) and DataFrame (2- dimensional). It can
# handle both homogeneous and heterogeneous data, and some of its many
# capabilities are:
# • ETL tools (Extraction, Transformation and Load tools)
# • Dealing with missing data (NaN)
# • Dealing with data files (csv, xls, db, hdf5, etc.)
# • Time-series manipulation tools
# In the Python ecosystem, Pandas is the best choice to retrieve, manipulate,
# analyze and transform financial data.

# 11.1 Pandas Installation

In [4]:
# The official documentation1 has a detailed explanation that spans over sev-
# eral pages on installing Pandas. We summarize it below.

# 11.1.1 Installing with pip

In [5]:
# The simplest way to install Pandas is from PyPI.
# In a terminal window, run the following command.

## pip install pandas

# In your code, you can use the escape character ’!’ to install pandas directly
# from your Python console.

## !pip install pandas

# Pip is a useful tool to manage Python’s packages and it is worth investing
# some time in knowing it better.

## pip help

# 11.1.2 Installing with Conda environments

In [6]:
# For advanced users, who like to work with Python environments for each
# project, you can create a new environment and install pandas as shown
# below.

## conda create -n EPAT python
## source activate EPAT
## conda install pandas

# 11.1.3 Testing Pandas installation

In [7]:
# To check the installation, Pandas comes with a test suite to test almost all of
# the codebase and verify that everything is working.

## import pandas as pd
## pd.test()

# 11.2 What problem does Pandas solve?

In [8]:
# Pandas works with homogeneous data series (1-Dimension) and heteroge-
# neous tabular data series (2-Dimensions). It includes a multitude of tools to
# work with these data types, such as:

# • Indexes and labels.
# • Searching of elements.
# • Insertion, deletion and modification of elements.
# • Apply set techniques, such as grouping, joining, selecting, etc.
# • Data processing and cleaning.
# • Work with time series.
# • Make statistical calculations
# • Draw graphics
# • Connectors for multiple data file formats, such as, csv, xlsx, hdf5, etc.

# 11.3 Pandas Series

In [9]:
# The first data structure in Pandas that we are going to see is the Series.
# They are homogeneous one-dimensional objects, that is, all data are of the
# same type and are implicitly labeled with an index.

In [10]:
# For example, we can have a Series of integers, real numbers, characters,
# strings, dictionaries, etc. We can conveniently manipulate these series
# performing operations like adding, deleting, ordering, joining, filtering,
# vectorized operations, statistical analysis, plotting, etc.

In [11]:
# Let’s see some examples of how to create and manipulate a Pandas Series:
import pandas as pd
s = pd.Series()
print(s)

Series([], dtype: object)

In [12]:
# Let’s create a Pandas Series of integers and print it:
import pandas as pd
s = pd.Series([1, 2, 3, 4, 5, 6, 7])
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [13]:
# Let’s create a Pandas Series of characters:
import pandas as pd
s = pd.Series(['a', 'b', 'c', 'd', 'e'])
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [14]:
# Let’s create a random Pandas Series of float numbers:
import pandas as pd
import numpy as np
s = pd.Series(np.random.randn(5))
print(s)

0    0.904613
1    2.330340
2    1.386693
3   -1.081357
4    0.085286
dtype: float64

In [15]:
# In all these examples, we have allowed the index label to appear by default
# (without explicitly programming it). It starts at 0, and we can check the
# index as:

s.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
# But we can also specify the index we need, for example:
s = pd.Series(np.random.randn(5), index= ['a', 'b', 'c', 'd', 'e'])
print(s)

a   -0.597548
b    1.329840
c   -0.668726
d    1.100999
e    1.071416
dtype: float64

In [17]:
# Let's create a Pandas Series from a dictionary:
import pandas as pd
dictionary = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
s =pd.Series(dictionary)
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
# In this case, the Pandas Series is created with the dictonary keys as index
# unless we specify any other index.

# 11.3.1 Simple operations with Pandas Series

In [19]:
# When we have a Pandas Series, we can perform several simple operations
# on it. For example, let’s create two Series. One from a dictionary and the
# other from an array of integers:

In [20]:
import pandas as pd
dictionary = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
s1 = pd.Series(dictionary)
print(s1)

array = [1, 2, 3, 4, 5]
s2 = pd.Series(array)
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
# We can perform operations similar to Numpy arrays:
# Selecting one item from the Pandas Series by means of its index:

s1[0]

/tmp/ipykernel_7652/4031512513.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

np.int64(1)

In [22]:
s1['a']

np.int64(1)

In [23]:
s2[0]

np.int64(1)

In [24]:
# Selecting several items from the Pandas Series by means of its index:
s1[[1, 4]]

/tmp/ipykernel_7652/3810037830.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[[1, 4]]

b    2
e    5
dtype: int64

In [25]:
s1[['b', 'e']]

b    2
e    5
dtype: int64

In [26]:
s2[[1, 4]]

1    2
4    5
dtype: int64

In [27]:
# Get the series starting from an element:
s1[2:]

c    3
d    4
e    5
dtype: int64

In [28]:
s2[2:]

2    3
3    4
4    5
dtype: int64

In [29]:
# Get the series up to one element:
s1[2:]

c    3
d    4
e    5
dtype: int64

In [30]:
s2[:2]

0    1
1    2
dtype: int64

In [31]:
# We can perform operations like a dictionary:

In [32]:
# Assign a value:
s1[1] = 99
print(s1)

a     1
b    99
c     3
d     4
e     5
dtype: int64

/tmp/ipykernel_7652/2971197163.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  s1[1] = 99

In [33]:
s2[1] = 99
print(s2)

0     1
1    99
2     3
3     4
4     5
dtype: int64

In [34]:
# Get a value by index (like dictionary key):
print(s)
s.get('b')

a    1
b    2
c    3
d    4
e    5
dtype: int64

np.int64(2)

In [35]:
# Here are some powerful vectorized operations that let us perform quickly calculations,for example:
# Add, subtract, multiply, divide, power, and almost any NumPy function that accepts NumPy arrays.
## s1 + 2
## s1 - 2
## s1 * 2
## s1 / 2
## s1 ** 2
## np.exp(s1)

In [36]:
# We can perform the same operations over two Pandas Series although
# these must be aligned, that is, to have the same index, in other case,
# perform a Union operation.

import pandas as pd
dictionary = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
s1 = pd.Series(dictionary)
print(s1)

array = [1, 2, 3, 4, 5]
s2 = pd.Series(array)
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [37]:
s1 + s1 # The indices are aligned
print(s1 + s1)

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [38]:
s1 + s2 # The indices are unaligned
print(s1 + s2)

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64

# 11.4 Pandas DataFrame

In [39]:
# The second data structure in Pandas that we are going to see is the DataFrame.

In [40]:
# Pandas DataFrame is a heterogeneous two-dimensional object, that is, the
# data are of the same type within each column but it could be a different
# data type for each column and are implicitly or explicitly labeled with an
# index.

In [41]:
# We can think of a DataFrame as a database table, in which we store heterogeneous data. For example, 
# a DataFrame with one column for the first name, another for the last name and a third column for the phone 
# number, or a dataframe with columns to store the opening price, close price, high, low, volume, and so on.

In [42]:
# The index can be implicit, starting with zero or we can specify it ourselves,
# even working with dates and times as indexes as well. Let’s see some examples 
# of how to create and manipulate a Pandas DataFrame.

In [43]:
# Creating an empty DataFrame:
import pandas as pd
s = pd.DataFrame()
print(s)

Empty DataFrame
Columns: []
Index: []

In [44]:
# Creating an empty structure DataFrame:
import pandas as pd
s = pd.DataFrame(columns=['A', 'B', 'C', 'D', 'E'], index=range(1, 6))
print(s)

     A    B    C    D    E
1  NaN  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN  NaN

In [45]:
# Creating a DataFrame passing a NumPy array:
array = {'A' : [1, 2, 3, 4],
         'B' : [4, 3, 2, 1]}
pd.DataFrame(array)

   A  B
0  1  4
1  2  3
2  3  2
3  4  1

In [46]:
# Creating a DataFrame passing a NumPy array, with datetime index:
import pandas as pd 
array = {'A': [1, 2, 3, 4], 'B': [4, 3, 2, 1]}
index = pd.DatetimeIndex(['2018-12-01', '2018-12-02', '2018-12-03', '2018-12-04'])
pd.DataFrame(array, index=index)

            A  B
2018-12-01  1  4
2018-12-02  2  3
2018-12-03  3  2
2018-12-04  4  1

In [47]:
# Creating a DataFrame passing a Dictionary:
import pandas as pd
dictionary = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
pd.DataFrame([dictionary])

   a  b  c  d  e
0  1  2  3  4  5

In [48]:
# Viewing a DataFrame: We can use some methods to explore the Pandas DataFrame:
# First, we go to create a Pandas DataFrame to work with it.
import pandas as pd
pd.DataFrame({'A': np.random.randn(10),
              'B': np.random.randn(10),
              'C': np.random.randn(10)})

          A         B         C
0 -0.115255  0.725032 -0.512907
1 -1.135256 -0.187519 -1.958583
2  0.728137  0.084009  0.701224
3 -0.639946  0.789538 -0.969800
4 -1.733467  0.880339  0.338776
5 -0.316618 -1.087781  0.773003
6 -2.928715  0.447762 -1.375594
7  1.695077 -0.505442  1.172897
8 -1.200760 -1.435355  0.193307
9 -0.658945  0.078839  1.102058

In [49]:
# Get the first three rows:
import pandas as pd
df = pd.DataFrame({'A': np.random.randn(10),
                  'B': np.random.randn(10),
                  'C': np.random.randn(10)})
df.head(3)

          A         B         C
0  0.397701  0.990562  1.163514
1  0.959700 -0.011037 -1.661046
2  0.323207  1.842709 -1.608458

In [50]:
# Get the last three rows:
import pandas as pd
df = pd.DataFrame({'A': np.random.randn(10),
                  'B': np.random.randn(10),
                  'C': np.random.randn(10)})
df.tail(3)

          A         B         C
7  0.278565 -0.752109  0.850734
8 -0.438471 -0.745357  0.019313
9 -0.964203  0.577769 -1.004516

In [51]:
# Get the DataFrame's index:
import pandas as pd
df = pd.DataFrame({'A': np.random.randn(10),
                   'B': np.random.randn(10),
                   'C': np.random.randn(10)})
df.index

RangeIndex(start=0, stop=10, step=1)

In [52]:
# Get the DataFrame's columns:
import pandas as pd 
df = pd.DataFrame({'A': np.random.randn(10),
                   'B': np.random.randn(10),
                   'C': np.random.randn(10)})
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [53]:
# Get the DataFrame's values:
import pandas as pd
df = pd.DataFrame({'A': np.random.rand(10),
                   'B': np.random.randn(10),
                   'C': np.random.randn(10)})
df.values

array([[ 0.67039894, -0.40319856,  2.28744725],
       [ 0.64685963,  0.25427199, -0.52460685],
       [ 0.01214969,  0.40760016,  0.22523932],
       [ 0.72302843,  0.81797198,  1.09979482],
       [ 0.84375436,  0.32250556, -1.40422084],
       [ 0.58342615, -1.01545244, -0.73427537],
       [ 0.43392786,  0.1224972 ,  0.47536438],
       [ 0.5818388 , -0.63935871, -0.50348102],
       [ 0.38328059, -0.68692037,  0.36744373],
       [ 0.25842745,  0.15072303, -0.05348445]])

# 11.5 Importing data in Pandas

In [54]:
# Pandas DataFrame is able to read several data formats, some of the most
# used are: CSV, JSON, Excel, HDF5, SQL, etc.

# 11.5.1 Importing data from CSV file

In [55]:
# One of the most useful functions is read_csv that allows us to read csv files
# with almost any format and load it into our DataFrame to work with it.
# Let’s see how to work with csv files:

import pandas as pd
df = pd.read_csv('/home/bipinhyoju/Downloads/csv files/names.csv')
type(df)

pandas.core.frame.DataFrame

In [56]:
# This simple operation, loads the csv file into the Pandas DataFrame after
# which we can explore it as we have seen before.

# 11.5.2 Customizing pandas import

In [57]:
# Sometimes the format of the csv file come with a particular separator or we
# need specific columns or rows. We will now see some ways to deal with this.
# In this example, we want to load a csv file with blank space as separator:

import pandas as pd
df = pd.read_csv('/home/bipinhyoju/Downloads/csv files/names.csv', sep='\s+', engine='python')
print(df)

# In this example, we want to load columns from 0 and 5 and the first 100 rows:

import pandas as pd
df = pd.read_csv('/home/bipinhyoju/Downloads/csv files/sales_data.csv', usecols=[0, 1, 2, 3, 4, 5], nrows=100)
print(df)

# It’s possible to customize the headers, convert the columns or rows names
# and carry out a good number of other operations.

                         first_name,last_name,email
0                  John,Doe,john-doe@bogusemail.com
1     Mary,Smith-Robinson,maryjacobs@bogusemail.com
2               Dave,Smith,davesmith@bogusemail.com
3             Jane,Stuart,janestuart@bogusemail.com
4               Tom,Wright,tomwright@bogusemail.com
5       Steve,Robinson,steverobinson@bogusemail.com
6         Nicole,Jacobs,nicolejacobs@bogusemail.com
7             Jane,Wright,janewright@bogusemail.com
8                   Jane,Doe,janedoe@bogusemail.com
9             Kurt,Wright,kurtwright@bogusemail.com
10        Kurt,Robinson,kurtrobinson@bogusemail.com
11          Jane,Jenkins,janejenkins@bogusemail.com
12        Neil,Robinson,neilrobinson@bogusemail.com
13        Tom,Patterson,tompatterson@bogusemail.com
14            Sam,Jenkins,samjenkins@bogusemail.com
15          Steve,Stuart,stevestuart@bogusemail.com
16  Maggie,Patterson,maggiepatterson@bogusemail.com
17        Maggie,Stuart,maggiestuart@bogusemail.com
18                  Jane,Doe,janedoe@bogusemail.com
19    Steve,Patterson,stevepatterson@bogusemail.com
20              Dave,Smith,davesmith@bogusemail.com
21                Sam,Wilks,samwilks@bogusemail.com
22      Kurt,Jefferson,kurtjefferson@bogusemail.com
23              Sam,Stuart,samstuart@bogusemail.com
24            Jane,Stuart,janestuart@bogusemail.com
25              Dave,Davis,davedavis@bogusemail.com
26        Sam,Patterson,sampatterson@bogusemail.com
27        Tom,Jefferson,tomjefferson@bogusemail.com
28            Jane,Stuart,janestuart@bogusemail.com
29  Maggie,Jefferson,maggiejefferson@bogusemail.com
30              Mary,Wilks,marywilks@bogusemail.com
31      Neil,Patterson,neilpatterson@bogusemail.com
32            Corey,Davis,coreydavis@bogusemail.com
33          Steve,Jacobs,stevejacobs@bogusemail.com
34          Jane,Jenkins,janejenkins@bogusemail.com
35            John,Jacobs,johnjacobs@bogusemail.com
36              Neil,Smith,neilsmith@bogusemail.com
37            Corey,Wilks,coreywilks@bogusemail.com
38            Corey,Smith,coreysmith@bogusemail.com
39      Mary,Patterson,marypatterson@bogusemail.com
40            Jane,Stuart,janestuart@bogusemail.com
41        Travis,Arnold,travisarnold@bogusemail.com
42        John,Robinson,johnrobinson@bogusemail.com
43        Travis,Arnold,travisarnold@bogusemail.com
   invoice_no customer_id         category  quantity    price invoice_date
0     I138884     C241288         Clothing         5  1500.40   05-08-2022
1     I317333     C111565            Shoes         3  1800.51   12-12-2021
2     I127801     C266599         Clothing         1   300.08   09-11-2021
3     I173702     C988172            Shoes         5  3000.85   16-05-2021
4     I337046     C189076            Books         4    60.60   24-10-2021
..        ...         ...              ...       ...      ...          ...
95    I172458     C277842         Clothing         2   600.16   17-12-2021
96    I297270     C183011         Clothing         5  1500.40   31-12-2022
97    I153930     C567813  Food & Beverage         3    15.69   09-08-2022
98    I282854     C282974         Clothing         3   900.24   31-07-2022
99    I869144     C181972  Food & Beverage         4    20.92   04-05-2021

[100 rows x 6 columns]

<>:6: SyntaxWarning: invalid escape sequence '\s'
<>:6: SyntaxWarning: invalid escape sequence '\s'
/tmp/ipykernel_7652/3313490042.py:6: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv('/home/bipinhyoju/Downloads/csv files/names.csv', sep='\s+', engine='python')

# 11.5.3 Importing data from Excel files

In [58]:
# In the same way that we have worked with csv files, we can work with
# Excel file with the read_excel function, let’s see some examples:

# In this example, we want to load the sheet 1 from an Excel file:

import pandas as pd

df = pd.read_excel('/home/bipinhyoju/Downloads/xls files/datafile.xls', sheet_name='Worksheet')

print(df) 

# This simple operation, loads the Sheet 1 from the Excel file into the Pandas DataFrame.

WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
   Year (Col.1)  Geographical Area (Col.2)  \
0       2000-01                     328726
1       2001-02                     328726
2       2002-03                     328726
3       2003-04                     328726
4       2004-05                     328726
5       2005-06                     328726
6       2006-07                     328726
7       2007-08                     328726
8       2008-09                     328726
9       2009-10                     328726
10      2010-11                     328726
11      2011-12                     328726
12      2012-13                     328726
13      2013-14                     328726
14      2014-15                     328726

    Reporting area for Land utilisation statistics (Col.3 = Col.4+Col.7+ Col.11+Col.14+Col.15)  \
0                                              305195
1                                              305127
2                                              305358
3                                              305567
4                                              305587
5                                              306884
6                                              307088
7                                              307232
8                                              307408
9                                              307408
10                                             307483
11                                             307392
12                                             307491
13                                             307796
14                                             307818

    Forests (Col.4)  \
0             69843
1             69720
2             69821
3             69968
4             69960
5             71431
6             71463
7             71529
8             71543
9             71555
10            71593
11            71599
12            71573
13            71828
14            71794

    Not available for cultivation - Area under non-agricultural uses (Col.5)  \
0                                               23752
1                                               23914
2                                               24119
3                                               24516
4                                               24761
5                                               24993
6                                               25445
7                                               25882
8                                               26211
9                                               26158
10                                              26400
11                                              26308
12                                              26504
13                                              26913
14                                              26883

    Not available for cultivation - Barren and unculturable Land (Col.6)  \
0                                               17483
1                                               17414
2                                               17517
3                                               17466
4                                               17468
5                                               17331
6                                               17287
7                                               17020
8                                               16851
9                                               17177
10                                              17175
11                                              17217
12                                              17072
13                                              16948
14                                              16996

    Not available for cultivation - Total (Col.7 = Col.5+Col.6)  \
0                                               41235
1                                               41328
2                                               41636
3                                               41982
4                                               42229
5                                               42323
6                                               42732
7                                               42902
8                                               43062
9                                               43334
10                                              43575
11                                              43525
12                                              43577
13                                              43861
14                                              43880

    Other uncultivated Land excluding Fallow Land - Permanent pastures & other Grazing Lands (Col.8)  \
0                                               10662
1                                               10528
2                                               10450
3                                               10484
4                                               10452
5                                               10444
6                                               10418
7                                               10362
8                                               10344
9                                               10340
10                                              10305
11                                              10314
12                                              10256
13                                              10258
14                                              10258

    Other uncultivated Land excluding Fallow Land - Land under Misc. tree crops & groves (not incl. in net area sown) (Col.9)  \
0                                                3445
1                                                3442
2                                                3431
3                                                3381
4                                                3362
5                                                3391
6                                                3351
7                                                3400
8                                                3343
9                                                3214
10                                               3200
11                                               3161
12                                               3182
13                                               3187
14                                               3104

    Other uncultivated Land excluding Fallow Land - Culturable waste Land (Col.10)  \
0                                               13631
1                                               13520
2                                               13651
3                                               13241
4                                               13272
5                                               13225
6                                               13274
7                                               13044
8                                               12735
9                                               12945
10                                              12647
11                                              12637
12                                              12643
13                                              12388
14                                              12469

    Other uncultivated Land excluding Fallow Land - Total (Col.11 = Col.8 to Col.10)  \
0                                               27737
1                                               27489
2                                               27532
3                                               27106
4                                               27086
5                                               27060
6                                               27042
7                                               26806
8                                               26423
9                                               26499
10                                              26152
11                                              26111
12                                              26082
13                                              25832
14                                              25832

    Fallow Lands - Fallow Lands other than current fallows (Col.12)  \
0                                               10267
1                                               10513
2                                               11966
3                                               11313
4                                               10878
5                                               10696
6                                               10516
7                                               10333
8                                               10290
9                                               10838
10                                              10323
11                                              10665
12                                              11037
13                                              10694
14                                              11092

    Fallow Lands - Current fallows (Col.13)  \
0                                     14777
1                                     15343
2                                     22459
3                                     14489
4                                     14792
5                                     14213
6                                     15512
7                                     14646
8                                     14192
9                                     16009
10                                    14277
11                                    14512
12                                    15287
13                                    14154
14                                    15091

    Fallow Lands - Total Col.14 = (Col.12+Col.13)  Net area Sown (Col.15)  \
0                                           25044                  141336
1                                           25856                  140734
2                                           34426                  131943
3                                           25802                  140708
4                                           25670                  140642
5                                           24908                  141162
6                                           26028                  139823
7                                           24979                  141016
8                                           24482                  141899
9                                           26847                  139173
10                                          24600                  141563
11                                          25177                  140980
12                                          26324                  139936
13                                          24848                  141427
14                                          26182                  140130

    Total cropped area (Col.16)  \
0                        185340
1                        188014
2                        173889
3                        189661
4                        191103
5                        192737
6                        192381
7                        195223
8                        195328
9                        189188
10                       197683
11                       195796
12                       194246
13                       200950
14                       198360

    Area sown more than once (Col.17 = Col.16-Col.15)  \
0                                               44005
1                                               47280
2                                               41947
3                                               48953
4                                               50461
5                                               51575
6                                               52558
7                                               54207
8                                               53429
9                                               50015
10                                              56120
11                                              54816
12                                              54310
13                                              59523
14                                              58230

    Agricultural Land/Cultivable Land/Culturable Land/Arable Land (Col.18 = Col.9+Col.10+Col.14+Col.15)  \
0                                              183455
1                                              183552
2                                              183450
3                                              183132
4                                              182946
5                                              182686
6                                              182476
7                                              182438
8                                              182459
9                                              182179
10                                             182010
11                                             181955
12                                             182085
13                                             181850
14                                             181886

    Cultivated Land (Col.19 = Col.13+Col.15)  \
0                                     156113
1                                     156077
2                                     154402
3                                     155198
4                                     155434
5                                     155375
6                                     155334
7                                     155662
8                                     156091
9                                     155182
10                                    155840
11                                    155492
12                                    155223
13                                    155581
14                                    155221

    Cropping Intensity (Col.20 = % of Col.16 over Col.15)
0                                               131.1
1                                               133.6
2                                               131.8
3                                               134.8
4                                               135.9
5                                               136.5
6                                               137.6
7                                               138.4
8                                               137.7
9                                               135.9
10                                              139.6
11                                              138.9
12                                              138.8
13                                              142.0
14                                              141.6

# 11.6 Indexing and Subsetting

In [59]:
# Once we have the Pandas DataFrame prepared, independent of the source
# of our data (csv, Excel, hdf5, etc.) we can work with it, as if it were a
# database table, selecting the elements that interest us. We will work with
# some examples on how to index and extract subsets of data.

In [60]:
# Let’s begin with loading a csv file having details of a market instrument.

In [61]:
import pandas as pd
df=pd.read_csv('/home/bipinhyoju/Downloads/csv files/msft.csv')
print(df)

         Date   Open   High    Low  Close    Volume  Adj. Close*
0   19-Sep-03  29.76  29.97  29.52  29.96  92433800        29.79
1   18-Sep-03  28.49  29.51  28.42  29.50  67268096        29.34
2   17-Sep-03  28.76  28.95  28.47  28.50  47221600        28.34
3   16-Sep-03  28.41  28.95  28.32  28.90  52060600        28.74
4   15-Sep-03  28.37  28.61  28.33  28.36  41432300        28.20
..        ...    ...    ...    ...    ...       ...          ...
60  25-Jun-03  25.64  25.99  25.14  25.26  60483500        25.12
61  24-Jun-03  25.65  26.04  25.52  25.70  51820300        25.56
62  23-Jun-03  26.14  26.24  25.49  25.78  52584500        25.64
63  20-Jun-03  26.34  26.38  26.01  26.33  86048896        26.18
64  19-Jun-03  26.09  26.39  26.01  26.07  63626900        25.92

[65 rows x 7 columns]

In [62]:
import pandas as pd
df=pd.read_csv('/home/bipinhyoju/Downloads/csv files/msft.csv', usecols=[0, 1, 2, 3, 4])
print(df)

         Date   Open   High    Low  Close
0   19-Sep-03  29.76  29.97  29.52  29.96
1   18-Sep-03  28.49  29.51  28.42  29.50
2   17-Sep-03  28.76  28.95  28.47  28.50
3   16-Sep-03  28.41  28.95  28.32  28.90
4   15-Sep-03  28.37  28.61  28.33  28.36
..        ...    ...    ...    ...    ...
60  25-Jun-03  25.64  25.99  25.14  25.26
61  24-Jun-03  25.65  26.04  25.52  25.70
62  23-Jun-03  26.14  26.24  25.49  25.78
63  20-Jun-03  26.34  26.38  26.01  26.33
64  19-Jun-03  26.09  26.39  26.01  26.07

[65 rows x 5 columns]

In [63]:
import pandas as pd
df=pd.read_csv('/home/bipinhyoju/Downloads/csv files/msft.csv', usecols=[0, 1, 2, 3, 4])
df.head()

        Date   Open   High    Low  Close
0  19-Sep-03  29.76  29.97  29.52  29.96
1  18-Sep-03  28.49  29.51  28.42  29.50
2  17-Sep-03  28.76  28.95  28.47  28.50
3  16-Sep-03  28.41  28.95  28.32  28.90
4  15-Sep-03  28.37  28.61  28.33  28.36

In [64]:
import pandas as pd
df=pd.read_csv('/home/bipinhyoju/Downloads/csv files/msft.csv', usecols=[0, 1, 2, 3, 4])
df.shape

(65, 5)

In [65]:
# Here, we have read a csv file, of which we only need the columns of date,
# opening, closing, high and low (the first 5 columns) and we check the form
# of the DataFrame that has 1000 rows and 5 columns.

# 11.6.1 Selecting a single column

In [66]:
# In the previous code, we have read directly the first 5 columns from the
# csv file. This is a filter that we applied, because we were only interested in
# those columns.
# We can apply selection filters to the DataFrame itself, to select one column
# to work with. For example, we could need the Close column:

In [67]:
close = df['Close']
close.head()

0    29.96
1    29.50
2    28.50
3    28.90
4    28.36
Name: Close, dtype: float64

# 11.6.2 Selecting multiple columns

In [68]:
import pandas as pd
df=pd.read_csv('/home/bipinhyoju/Downloads/csv files/msft.csv')
print(df)

         Date   Open   High    Low  Close    Volume  Adj. Close*
0   19-Sep-03  29.76  29.97  29.52  29.96  92433800        29.79
1   18-Sep-03  28.49  29.51  28.42  29.50  67268096        29.34
2   17-Sep-03  28.76  28.95  28.47  28.50  47221600        28.34
3   16-Sep-03  28.41  28.95  28.32  28.90  52060600        28.74
4   15-Sep-03  28.37  28.61  28.33  28.36  41432300        28.20
..        ...    ...    ...    ...    ...       ...          ...
60  25-Jun-03  25.64  25.99  25.14  25.26  60483500        25.12
61  24-Jun-03  25.65  26.04  25.52  25.70  51820300        25.56
62  23-Jun-03  26.14  26.24  25.49  25.78  52584500        25.64
63  20-Jun-03  26.34  26.38  26.01  26.33  86048896        26.18
64  19-Jun-03  26.09  26.39  26.01  26.07  63626900        25.92

[65 rows x 7 columns]

In [69]:
# We can select multiple columns too:
closevol = df[['Close', 'Volume']]
closevol.head()

   Close    Volume
0  29.96  92433800
1  29.50  67268096
2  28.50  47221600
3  28.90  52060600
4  28.36  41432300

In [70]:
# 11.6.3 Selecting rows via []
# We can select a set of rows by index:
import pandas as pd 
df= pd.read_csv('/home/bipinhyoju/Downloads/csv files/TSLA.csv')
df[100:110]

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
100,2019-10-11,49.430000,50.216000,49.362000,49.577999,42377000,0,0.0
101,2019-10-14,49.580002,51.709999,49.425999,51.391998,51025000,0,0.0
102,2019-10-15,51.540001,52.000000,50.824001,51.577999,32164000,0,0.0
103,2019-10-16,51.478001,52.419998,51.383999,51.950001,33420500,0,0.0
104,2019-10-17,52.500000,52.956001,52.034000,52.394001,23846500,0,0.0
105,2019-10-18,52.139999,52.560001,51.020000,51.389999,28749000,0,0.0
106,2019-10-21,51.666000,51.900002,50.035999,50.700001,25101500,0,0.0
107,2019-10-22,50.863998,51.666000,50.169998,51.116001,23004000,0,0.0
108,2019-10-23,50.900002,51.228001,50.270000,50.936001,26305500,0,0.0
109,2019-10-24,59.674000,60.986000,57.840000,59.936001,148604500,0,0.0

In [71]:
# Or we can select a set of rows and columns:
df[100:110][['Close', 'Volume']]

         Close     Volume
100  49.577999   42377000
101  51.391998   51025000
102  51.577999   32164000
103  51.950001   33420500
104  52.394001   23846500
105  51.389999   28749000
106  50.700001   25101500
107  51.116001   23004000
108  50.936001   26305500
109  59.936001  148604500

In [72]:
# 11.6.4 Selecting via .loc[] (By label)

# With df.loc we can do the same selections using labels:
# To select a set of rows, we can code the following using the index number as label:

df.loc[100:110]

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
100,2019-10-11,49.430000,50.216000,49.362000,49.577999,42377000,0,0.0
101,2019-10-14,49.580002,51.709999,49.425999,51.391998,51025000,0,0.0
102,2019-10-15,51.540001,52.000000,50.824001,51.577999,32164000,0,0.0
103,2019-10-16,51.478001,52.419998,51.383999,51.950001,33420500,0,0.0
104,2019-10-17,52.500000,52.956001,52.034000,52.394001,23846500,0,0.0
105,2019-10-18,52.139999,52.560001,51.020000,51.389999,28749000,0,0.0
106,2019-10-21,51.666000,51.900002,50.035999,50.700001,25101500,0,0.0
107,2019-10-22,50.863998,51.666000,50.169998,51.116001,23004000,0,0.0
108,2019-10-23,50.900002,51.228001,50.270000,50.936001,26305500,0,0.0
109,2019-10-24,59.674000,60.986000,57.840000,59.936001,148604500,0,0.0
110,2019-10-25,59.543999,66.000000,59.222000,65.625999,150030500,0,0.0

In [73]:
# Or we can select a set of rows and columns like before:
df.loc[100:110, ['Close', 'Volume']]

         Close     Volume
100  49.577999   42377000
101  51.391998   51025000
102  51.577999   32164000
103  51.950001   33420500
104  52.394001   23846500
105  51.389999   28749000
106  50.700001   25101500
107  51.116001   23004000
108  50.936001   26305500
109  59.936001  148604500
110  65.625999  150030500

# 11.6.5 Selecting via .iloc[] (By position)

In [74]:
# With df.iloc we can do the same selections using integer position:
df.iloc[100:110]

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
100,2019-10-11,49.430000,50.216000,49.362000,49.577999,42377000,0,0.0
101,2019-10-14,49.580002,51.709999,49.425999,51.391998,51025000,0,0.0
102,2019-10-15,51.540001,52.000000,50.824001,51.577999,32164000,0,0.0
103,2019-10-16,51.478001,52.419998,51.383999,51.950001,33420500,0,0.0
104,2019-10-17,52.500000,52.956001,52.034000,52.394001,23846500,0,0.0
105,2019-10-18,52.139999,52.560001,51.020000,51.389999,28749000,0,0.0
106,2019-10-21,51.666000,51.900002,50.035999,50.700001,25101500,0,0.0
107,2019-10-22,50.863998,51.666000,50.169998,51.116001,23004000,0,0.0
108,2019-10-23,50.900002,51.228001,50.270000,50.936001,26305500,0,0.0
109,2019-10-24,59.674000,60.986000,57.840000,59.936001,148604500,0,0.0

In [75]:
# In the last example, we used the index as an integer position rather than by label.
# We can select a set of rows and columns like before:
df.iloc[100:110, [3,4]]

           Low      Close
100  49.362000  49.577999
101  49.425999  51.391998
102  50.824001  51.577999
103  51.383999  51.950001
104  52.034000  52.394001
105  51.020000  51.389999
106  50.035999  50.700001
107  50.169998  51.116001
108  50.270000  50.936001
109  57.840000  59.936001

# 11.6.6 Boolean indexing

In [76]:
# So far, we have sliced subsets of data by label or by position. Now let’s
# see how to select data that meet some criteria. We do this with Boolean
# indexing. We can use the same criteria similar to what we have seen with
# Numpy arrays. We show you just two illustrative examples here. This is by
# no means enough to get comfortable with it and so would encourage you
# to check the documentation and further readings at the end of this chapter
# to learn more.
# • We can filter data that is greater (less) than a number.

df[df.Close > 110]

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
169,2020-01-22,114.377998,118.900002,111.820000,113.912003,156845000,0,0.0
170,2020-01-23,112.849998,116.400002,111.120003,114.440002,98255000,0,0.0
171,2020-01-24,114.125999,114.772003,110.851997,112.963997,71768000,0,0.0
172,2020-01-27,108.398003,112.888000,107.856003,111.603996,68040500,0,0.0
173,2020-01-28,113.697998,115.362000,111.615997,113.379997,58942500,0,0.0
...,...,...,...,...,...,...,...,...
753,2022-05-16,767.159973,769.760010,719.090027,724.369995,28699500,0,0.0
754,2022-05-17,747.359985,764.479980,728.849976,761.609985,26745400,0,0.0
755,2022-05-18,744.520020,760.500000,700.809998,709.809998,29270600,0,0.0
756,2022-05-19,707.000000,734.000000,694.109985,709.419983,30098900,0,0.0
757,2022-05-20,713.989990,721.580017,633.000000,663.900024,48190600,0,0.0

In [77]:
df[(df['Close'] > 110) | (df['Close'] < 120)]

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
0,2019-05-21,39.551998,41.480000,39.208000,41.015999,90019500,0,0.0
1,2019-05-22,39.820000,40.787998,38.355999,38.546001,93426000,0,0.0
2,2019-05-23,38.868000,39.894001,37.243999,39.098000,132735500,0,0.0
3,2019-05-24,39.966000,39.995998,37.750000,38.125999,70683000,0,0.0
4,2019-05-28,38.240002,39.000000,37.570000,37.740002,51564500,0,0.0
...,...,...,...,...,...,...,...,...
753,2022-05-16,767.159973,769.760010,719.090027,724.369995,28699500,0,0.0
754,2022-05-17,747.359985,764.479980,728.849976,761.609985,26745400,0,0.0
755,2022-05-18,744.520020,760.500000,700.809998,709.809998,29270600,0,0.0
756,2022-05-19,707.000000,734.000000,694.109985,709.419983,30098900,0,0.0
757,2022-05-20,713.989990,721.580017,633.000000,663.900024,48190600,0,0.0

# 11.7 Manipulating a DataFrame

In [ ]:
# When we are working with data, the most common structure is the
# DataFrame. Until now we have seen how to create them, make selections
# and find data. We are now going to see how to manipulate the DataFrame
# to transform it into another DataFrame that has the form that our problem
# requires.

# We’ll see how to sort it, re-index it, eliminate unwanted (or spurious) data,
# add or remove columns and update values.

# 11.7.1 Transpose using .T

In [78]:
# The Pandas DataFrame transpose function T allows us to transpose the
# rows as columns, and logically the columns as rows:

import pandas as pd
df = pd.read_csv('/home/bipinhyoju/Downloads/csv files/TSLA.csv')
df2 = df[100:110][['Close', 'Volume']]
df2.T

,100,101,102,103,104,105,106,107,108,109
Close,4.957800e+01,5.139200e+01,5.157800e+01,5.195000e+01,5.239400e+01,5.139000e+01,5.070000e+01,5.111600e+01,5.093600e+01,5.993600e+01
Volume,4.237700e+07,5.102500e+07,3.216400e+07,3.342050e+07,2.384650e+07,2.874900e+07,2.510150e+07,2.300400e+07,2.630550e+07,1.486045e+08

# 11.7.2 The .sort_index() method

In [79]:
# When we are working with Pandas Dataframe it is usual to add or remove
# rows, order by columns, etc. That’s why it’s important to have a function
# that allows us to easily and comfortably sort the DataFrame by its index.
# We do this with the sort_index function of Pandas DataFrame.

df.sort_index()

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
0,2019-05-21,39.551998,41.480000,39.208000,41.015999,90019500,0,0.0
1,2019-05-22,39.820000,40.787998,38.355999,38.546001,93426000,0,0.0
2,2019-05-23,38.868000,39.894001,37.243999,39.098000,132735500,0,0.0
3,2019-05-24,39.966000,39.995998,37.750000,38.125999,70683000,0,0.0
4,2019-05-28,38.240002,39.000000,37.570000,37.740002,51564500,0,0.0
...,...,...,...,...,...,...,...,...
753,2022-05-16,767.159973,769.760010,719.090027,724.369995,28699500,0,0.0
754,2022-05-17,747.359985,764.479980,728.849976,761.609985,26745400,0,0.0
755,2022-05-18,744.520020,760.500000,700.809998,709.809998,29270600,0,0.0
756,2022-05-19,707.000000,734.000000,694.109985,709.419983,30098900,0,0.0
757,2022-05-20,713.989990,721.580017,633.000000,663.900024,48190600,0,0.0

# 11.7.3 The .sort_values() method

In [80]:
# Sometimes, we may be interested in sorting the DataFrame by some column
# or even with several columns as criteria. For example, sort the column by
# first names and the second criterion by last names. We do this with the
# sort_values function of Pandas DataFrame.

df.sort_values(by= 'Close')

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
8,2019-06-03,37.102001,37.335999,35.397999,35.793999,65322000,0,0.0
7,2019-05-31,37.020000,37.984001,36.820000,37.032001,52033500,0,0.0
6,2019-05-30,37.750000,38.452000,37.403999,37.644001,39632500,0,0.0
4,2019-05-28,38.240002,39.000000,37.570000,37.740002,51564500,0,0.0
5,2019-05-29,37.419998,38.478001,37.007999,37.972000,59843000,0,0.0
...,...,...,...,...,...,...,...,...
661,2022-01-03,1147.750000,1201.069946,1136.040039,1199.780029,34643800,0,0.0
618,2021-11-01,1145.000000,1209.750000,1118.660034,1208.589966,56048700,0,0.0
620,2021-11-03,1177.329956,1215.390015,1152.619995,1213.859985,34628500,0,0.0
622,2021-11-05,1228.000000,1239.869995,1208.000000,1222.089966,21628800,0,0.0
621,2021-11-04,1234.410034,1243.489990,1217.000000,1229.910034,25397400,0,0.0

In [81]:
df.sort_values(by= ['Open', 'Close'])

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
9,2019-06-04,36.220001,38.796001,35.922001,38.720001,69037500,0,0.0
7,2019-05-31,37.020000,37.984001,36.820000,37.032001,52033500,0,0.0
8,2019-06-03,37.102001,37.335999,35.397999,35.793999,65322000,0,0.0
5,2019-05-29,37.419998,38.478001,37.007999,37.972000,59843000,0,0.0
6,2019-05-30,37.750000,38.452000,37.403999,37.644001,39632500,0,0.0
...,...,...,...,...,...,...,...,...
624,2021-11-09,1173.599976,1174.500000,1011.520020,1023.500000,59105800,0,0.0
620,2021-11-03,1177.329956,1215.390015,1152.619995,1213.859985,34628500,0,0.0
662,2022-01-04,1189.550049,1208.000000,1123.050049,1149.589966,33416100,0,0.0
622,2021-11-05,1228.000000,1239.869995,1208.000000,1222.089966,21628800,0,0.0
621,2021-11-04,1234.410034,1243.489990,1217.000000,1229.910034,25397400,0,0.0

# 11.7.4 The .reindex() function

In [ ]:
# The Pandas’ reindex funtion let us to realign the index of the Series or
# DataFrame, it’s useful when we need to reorganize the index to meet some
# criteria. For example, we can play with the Series or DataFrame that we
# create before to alter the original index. For example, when the index is a
# label, we can reorganize as we need:

In [82]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5), index= ['a', 'b', 'c', 'd', 'e'])
df

          0
a -0.041193
b -0.278919
c -1.485945
d  0.813617
e -0.135042

In [83]:
# Now, we can reorganize the index as follows:
df.reindex(['b', 'a', 'd', 'c', 'e'])

          0
b -0.278919
a -0.041193
d  0.813617
c -1.485945
e -0.135042

In [84]:
# When the index is numeric we can use the same function to order by hand
# the index:

import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5))
df.reindex([4, 3, 2, 1, 0])

          0
4  1.024558
3  0.776286
2  0.466289
1  0.226481
0  0.440921

In [85]:
# Later in this section, we’ll see how to work and reorganize date and time
# indices.

# 11.7.5 Adding a new column

In [ ]:
# Another interesting feature of DataFrames is the possibility of adding new
# columns to an existing DataFrame.
# For example, we can add a new column to the random DataFrame that we
# have created before:

In [88]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5))
print(df)

          0
0 -1.120573
1 -0.023396
2  0.898813
3  0.184526
4 -0.190831

In [89]:
# To add a new column, we only need to include the new column name in the
# DataFrame and assign a initialization value, or assign to the new column a
# Pandas Series or another column from other DataFrame.

In [90]:
df['new'] = 1
df

          0  new
0 -1.120573    1
1 -0.023396    1
2  0.898813    1
3  0.184526    1
4 -0.190831    1

# 11.7.6 Delete an existing column

In [92]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5,4))
print(df)

          0         1         2         3
0 -1.235728 -0.933597  2.210822 -0.335639
1 -0.064719 -0.703728 -0.086935 -1.016960
2  0.128844 -0.412476 -0.136359  1.071411
3  1.184168 -0.280952 -0.823022  1.465083
4 -1.447368 -1.485056  1.693150 -1.378049

In [98]:
# Now, we can delete the column that we specify by index or by label if any:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5,4))

del df[0]

print(df)

          1         2         3
0 -0.605802 -0.128698 -0.507866
1  0.567823 -0.765911 -0.810481
2 -0.808014  0.709900 -0.667111
3 -0.535651 -0.386829 -0.806992
4  0.051919 -0.389748  0.533185

In [103]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5,4))

del df[0]

print(df)

          1         2         3
0 -2.608111 -1.563082  0.248908
1  0.608884  0.643929  1.387672
2 -0.526858  0.593489  1.014612
3  1.399404 -0.819057 -0.907332
4  0.178634 -0.033514  1.141882

In [104]:
df['new'] = 1
df

          1         2         3  new
0 -2.608111 -1.563082  0.248908    1
1  0.608884  0.643929  1.387672    1
2 -0.526858  0.593489  1.014612    1
3  1.399404 -0.819057 -0.907332    1
4  0.178634 -0.033514  1.141882    1

In [105]:
del df['new']
print(df)

          1         2         3
0 -2.608111 -1.563082  0.248908
1  0.608884  0.643929  1.387672
2 -0.526858  0.593489  1.014612
3  1.399404 -0.819057 -0.907332
4  0.178634 -0.033514  1.141882

# 11.7.7 The .at[] (By label)

In [108]:
# With at we can to locate a specific value by row and column labels as follows:

import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5,4), index= ['a', 'b', 'c', 'd', 'e'], columns= [ 'A', 'B', 'C', 'D'])

print(df)

          A         B         C         D
a -1.514532 -1.453528 -0.977419 -0.268328
b  1.049319  0.892570 -1.053792  0.796351
c -0.505621 -1.216863  0.049326  1.228823
d  0.201838  0.634439  1.205004 -0.301553
e -0.252906 -2.115498  0.383046  0.597465

In [109]:
df.at['a', 'A']

np.float64(-1.5145317062751684)

In [111]:
# It is possible to assign a new value with the same funcion too:

df.at['a', 'A'] = 0
print(df)

          A         B         C         D
a  0.000000 -1.453528 -0.977419 -0.268328
b  1.049319  0.892570 -1.053792  0.796351
c -0.505621 -1.216863  0.049326  1.228823
d  0.201838  0.634439  1.205004 -0.301553
e -0.252906 -2.115498  0.383046  0.597465

In [112]:
# 11.7.8 the .iat (By position)

# With iat we can locate a specific value by row and index as follow:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)
df.iat[0, 0]

          A         B         C         D
a  0.506090  0.572871 -1.107777  0.413748
b  1.892530  1.180991 -0.292931  0.932159
c -0.251947 -1.542861  0.723294 -0.106190
d -0.140188 -0.165274 -1.265350 -1.921790
e -2.055474  0.577440  0.623161  0.410043

np.float64(0.5060901254055061)

In [114]:
# It is possible to assign a new value with the same funcion too:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)
df.iat[0, 0] = 0

          A         B         C         D
a -0.779212  0.595685  1.556587 -0.386736
b -0.806039 -0.086528  2.006485  0.460853
c -1.314368  1.183854  0.233083  1.232674
d -0.625835 -1.194173 -0.613656  1.656818
e  0.616713 -0.902465  1.736280  0.898451

# 11.7.9 Conditional updating of values

In [116]:
# Another useful function is to update values that meet some criteria, for
# example, update values whose values are greater than 0:

import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5,4), index= ['a', 'b', 'c', 'd', ' e'], columns= ['A', 'B', 'C', 'D'])
print(df)

           A         B         C         D
a  -0.359276 -0.628395  1.545207 -0.160583
b  -1.306404 -0.735481  0.277592  0.071221
c  -1.385012 -1.175592  0.704724 -0.026375
d   0.011522  0.227885  0.539219 -0.813117
 e  0.361406  2.246456  0.656841  0.431706

In [117]:
df[df > 0] = 1
df

           A         B    C         D
a  -0.359276 -0.628395  1.0 -0.160583
b  -1.306404 -0.735481  1.0  1.000000
c  -1.385012 -1.175592  1.0 -0.026375
d   1.000000  1.000000  1.0 -0.813117
 e  1.000000  1.000000  1.0  1.000000

In [121]:
# We can also update the values of a specific column that meet some criteria,
# or even work with several columns as criteria and update a specific column.
df['A'][df['A'] < 0] = 1
print(df)

      A         B    C         D
a   1.0 -0.628395  1.0 -0.160583
b   1.0 -0.735481  1.0  1.000000
c   1.0 -1.175592  1.0 -0.026375
d   1.0  1.000000  1.0 -0.813117
 e  1.0  1.000000  1.0  1.000000

/tmp/ipykernel_7652/3597219185.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['A'][df['A'] < 0] = 1

In [128]:
df.loc[(df['B'] < 0) & (df['C'] < 0), 'A'] = 9

print(df)

          A         B         C         D
a -1.707397  0.239532 -1.032637  0.728915
b -0.302534  1.184338 -0.042914 -1.221639
c  1.472746 -2.164597  0.724124  1.202819
d  0.227614  0.134702  1.250992  0.560247
e  9.000000 -0.354181 -0.411484  0.374263

# 11.7.10 The .dropna() method

In [123]:
# Occasionally, we may have a DataFrame that, for whatever reason, includes
# NA values. This type of values is usually problematic when we are making
# calculations or operations and must be treated properly before proceeding
# with them. The easiest way to eliminate NA values is to remove the row
# that contains it.

In [125]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a -1.707397  0.239532 -1.032637  0.728915
b -0.302534  1.184338 -0.042914 -1.221639
c  1.472746 -2.164597  0.724124  1.202819
d  0.227614  0.134702  1.250992  0.560247
e  0.374880 -0.354181 -0.411484  0.374263

In [127]:
df.loc[(df['B'] < 0) & (df['C'] < 0), 'A'] = np.nan

print(df)

          A         B         C         D
a -1.707397  0.239532 -1.032637  0.728915
b -0.302534  1.184338 -0.042914 -1.221639
c  1.472746 -2.164597  0.724124  1.202819
d  0.227614  0.134702  1.250992  0.560247
e       NaN -0.354181 -0.411484  0.374263

In [129]:
df = df.dropna()
print(df)

          A         B         C         D
a -1.707397  0.239532 -1.032637  0.728915
b -0.302534  1.184338 -0.042914 -1.221639
c  1.472746 -2.164597  0.724124  1.202819
d  0.227614  0.134702  1.250992  0.560247
e  9.000000 -0.354181 -0.411484  0.374263

In [130]:
# Here we are deleting the whole row that has, in any of its columns, a NaN
# value, but we can also specify that it deletes the column that any of its
# values is NaN:

df = df.dropna(axis=1)
print(df)

          A         B         C         D
a -1.707397  0.239532 -1.032637  0.728915
b -0.302534  1.184338 -0.042914 -1.221639
c  1.472746 -2.164597  0.724124  1.202819
d  0.227614  0.134702  1.250992  0.560247
e  9.000000 -0.354181 -0.411484  0.374263

In [131]:
# We can specify if a single NaN value is enough to delete the row or column,
# or if the whole row or column must have NaN to delete it.
# pythonpython df=df.dropna(how=’all’) print(df) “‘

# 11.7.11 The .fillna() method

In [132]:
# With the previous function we have seen how to eliminate a complete row
# or column that contains one or all the values to NaN, this operation can be
# a little drastic if we have valid values in the row or column.
# For this, it is interesting to use the fillna function that substitutes the NaN
# values with some fixed value.

import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns = ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a -0.666892  0.182337  0.242420  0.516539
b -0.521460  0.293415  0.229360  1.433807
c -2.094678  0.891222 -1.643587  2.623666
d -0.408668 -0.852653  0.914910  0.301023
e -0.981643  1.256216  0.710291 -1.171743

In [134]:
df.loc[(df['B'] < 0) & (df['C'] < 0), 'A'] = np.nan

print(df)

          A         B         C         D
a -0.666892  0.182337  0.242420  0.516539
b -0.521460  0.293415  0.229360  1.433807
c -2.094678  0.891222 -1.643587  2.623666
d -0.408668 -0.852653  0.914910  0.301023
e -0.981643  1.256216  0.710291 -1.171743

In [135]:
df.fillna(999)
print(df)

          A         B         C         D
a -0.666892  0.182337  0.242420  0.516539
b -0.521460  0.293415  0.229360  1.433807
c -2.094678  0.891222 -1.643587  2.623666
d -0.408668 -0.852653  0.914910  0.301023
e -0.981643  1.256216  0.710291 -1.171743

# 11.7.12 The .apply() method

In [137]:
# The apply is a very useful way to use functions or methods in a DataFrame
# without having to loop through it. We can apply the apply method to
# a Series or DataFrame to apply a function to all rows or columns of the
# DataFrame. Let’s see some examples.

In [136]:
# Suppose we are working with the randomly generated DataFrame and
# need to apply a function. In this example, for simplicity’s sake, we’re going
# to create a custom function to square a number.

In [140]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a -1.999750 -0.321757  1.646261  1.515571
b -1.355018 -0.836474 -0.130086 -0.317066
c  0.964877  0.200072  0.846015 -0.059308
d -0.875499  4.311572  1.615793 -0.612616
e  0.888267  0.036184 -0.107126  0.331851

In [141]:
def square_number(number):
    return number**2

# Test the function
square_number(2)

4

In [142]:
# Now, let’s use the custom function through Apply:

In [143]:
df.apply(square_number, axis= 1)

          A          B         C         D
a  3.999000   0.103527  2.710174  2.296955
b  1.836074   0.699689  0.016922  0.100531
c  0.930988   0.040029  0.715742  0.003517
d  0.766498  18.589652  2.610787  0.375298
e  0.789019   0.001309  0.011476  0.110125

In [144]:
# This method apply the funcion square_number to all rows of the DataFrame.

# 11.7.13 The .shift() function

In [ ]:
# The shift function allows us to move a row to the right or left and/or to
# move a column up or down. Let’s look at some examples.
# First, we are going to move the values of a column downwards:

In [145]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a -0.894558 -0.127453 -1.853428 -0.494429
b  0.622906  0.076646  1.038970 -0.271096
c  2.158347 -0.416885 -1.011095 -0.062685
d  0.084026 -0.143759 -0.212151 -0.128605
e -1.681603 -0.851444  0.693567 -0.257140

In [147]:
df['D'].shift(1)

a         NaN
b   -0.494429
c   -0.271096
d   -0.062685
e   -0.128605
Name: D, dtype: float64

In [148]:
df['shift'] = df['D'].shift(-1)

In [149]:
# This is very useful for comparing the current value with the previous value.

# 11.8 Statistical Exploratory data analysis

In [150]:
# Pandas DataFrame allows us to make some descriptive statistics calcula-
# tions, which are very useful to make a first analysis of the data we are han-
# dling. Let’s see some useful functions.

# 11.8.1 The info() function

It is a good practice to know the structure and format of our DataDrame, the Info function offers us just that:

In [1]:
# It is a good practice to know the structure and format of our DataFrame,
# the Info function offers us just that:

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 4), index=['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a -1.116430  0.968136 -1.303837  1.085266
b -0.194535  0.694252  1.648532 -0.561602
c -0.713545  0.347617  0.851690 -1.243066
d  0.914486 -0.119410 -0.014373 -1.769090
e -2.166153  1.066452 -0.168732  0.099575

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      float64
 1   B       5 non-null      float64
 2   C       5 non-null      float64
 3   D       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

# 11.8.2 The describe() function

In [4]:
# We can obtain a statistical overview of the DataFrame with the ‘describe
# function, which gives us the mean, median, standard deviation, maximum,
# minimum, quartiles, etc. of each DataFrame column.

In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a  0.583552  1.091753 -0.013465  1.379078
b  0.014346  0.267056  1.766092  0.105149
c  0.809989  1.125887 -0.649294  0.108232
d -0.780958  0.085224 -0.689080  0.318204
e  1.355052 -0.571481 -0.285292 -1.439263

In [6]:
df.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.396396  0.399688  0.025792  0.094280
std    0.815051  0.718674  1.011650  1.006592
min   -0.780958 -0.571481 -0.689080 -1.439263
25%    0.014346  0.085224 -0.649294  0.105149
50%    0.583552  0.267056 -0.285292  0.108232
75%    0.809989  1.091753 -0.013465  0.318204
max    1.355052  1.125887  1.766092  1.379078

# 11.8.3 The value_counts() function

In [7]:
# The function value_counts counts the repeated values of the specified column:

In [8]:
df['A'].value_counts()

A
 0.583552    1
 0.014346    1
 0.809989    1
-0.780958    1
 1.355052    1
Name: count, dtype: int64

# 11.8.4 The mean() function

In [9]:
# We can obtain the mean of a specific column or row by means of the mean function.

df['A'].mean() # Specifying a column

np.float64(0.3963960175775919)

In [10]:
df.mean() # By column
df.mean(axis= 0) # By column

A    0.396396
B    0.399688
C    0.025792
D    0.094280
dtype: float64

In [11]:
df.mean(axis= 1) # By row

a    0.760230
b    0.538161
c    0.348704
d   -0.266653
e   -0.235246
dtype: float64

# 11.8.5 The std() function

In [12]:
# We can obtain the standard deviation of a specific column or row by means of the std function.

In [13]:
df['A'].std() # Specifying a column
df.std(axis= 0) # By column

A    0.815051
B    0.718674
C    1.011650
D    1.006592
dtype: float64

In [14]:
df.std(axis=1) # By row

a    0.611746
b    0.825266
c    0.789646
d    0.550403
e    1.168227
dtype: float64

# 11.9 Filtering Pandas DataFrame

In [16]:
# We have already seen how to filter data in a DataFrame, including logical
# statements to filter rows or columns with some logical criteria. For example,
# we will filter rows whose column ’A’ is greater than zero:

import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5,4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])
print(df)

          A         B         C         D
a -0.123359  1.702449  0.140293  0.583011
b -0.894165  0.406148 -1.746094 -0.418879
c -1.343669 -0.451678 -1.257567  0.693560
d -0.622645  1.640728  2.406022 -1.617197
e -1.521752  0.137332 -0.888076  0.957745

In [17]:
df_filtered = df[df['A'] > 0]
print(df_filtered)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [18]:
# We can also combine logical statements, we will filter all rows whose column 
# ’A’ and ’B’ have their values greater than zero. We can also combine logical statements, we will filter all rows whose
# column 'A' and 'B' have their values greater than zero.

In [19]:
df_filtered = df[(df['A']) > 0 & (df['B'] > 0)]
print(df_filtered)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

# 11.10 Iterating Pandas DataFrame

In [20]:
# We can go through the DataFrame row by row to do operations in each
# iteration, let’s see some examples.

In [21]:
for item in df.iterrows():
    print(item)

('a', A   -0.123359
B    1.702449
C    0.140293
D    0.583011
Name: a, dtype: float64)
('b', A   -0.894165
B    0.406148
C   -1.746094
D   -0.418879
Name: b, dtype: float64)
('c', A   -1.343669
B   -0.451678
C   -1.257567
D    0.693560
Name: c, dtype: float64)
('d', A   -0.622645
B    1.640728
C    2.406022
D   -1.617197
Name: d, dtype: float64)
('e', A   -1.521752
B    0.137332
C   -0.888076
D    0.957745
Name: e, dtype: float64)

# 11.11 Merge, Append and Concat Pandas DataFrame

In [23]:
# Another interesting feature of DataFrames is that we can merge, concatenate them and add new values,
#  let’s see how to do each of these operations.
# • merge function allows us to merge two DataFrame by rows:

import pandas as pd 
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4),
                   index= ['a', 'b', 'c', 'd', 'e'], 
                   columns= ['A', 'B', 'C', 'D'])

print(df)

         A         B         C         D
a -0.69038  0.930891  0.410371 -1.367598
b -0.22892 -1.624499  0.130884 -1.283155
c -0.06332 -0.035429 -0.289605  1.485417
d  0.46303  0.469515  3.275970  1.198276
e  0.03028  0.857790  0.297989 -1.436928

In [25]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4), index= ['a', 'b', 'c', 'd', 'e'], columns= ['A', 'B', 'C', 'D'])

print(df)

          A         B         C         D
a -0.187179  0.038463 -0.429839  0.603189
b  0.405124 -0.417968  0.747288 -0.102104
c  0.660534 -0.472995  0.399894 -1.129453
d  0.376409 -1.262327  0.967231  0.903683
e  0.887852  0.838535 -0.906610 -1.258117

In [27]:
import pandas as pd
import numpy as np
df1=pd.DataFrame(np.random.randn(5, 4),
index=['a','b','c','d','e'],
columns=['A', 'B', 'C', 'D'])

In [28]:
df2=pd.DataFrame(np.random.randn(5, 4),
index=['a','b','c','d','e'],
columns=['A', 'B', 'C', 'D'])

In [29]:
df3 = pd.merge(df1, df2)
print(df3)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [31]:
# append function allows us to append rows from one DataFrame to
# another DataFrame by rows:

import pandas as pd
import numpy as np
df1=pd.DataFrame(np.random.randn(5, 4),
index=['a','b','c','d','e'],
columns=['A', 'B', 'C', 'D'])


df2=pd.DataFrame(np.random.randn(5, 4),
index=['a','b','c','d','e'],
columns=['A', 'B', 'C', 'D'])

In [32]:
df3 = df1.append(df2)
print(df3)

AttributeError: 'DataFrame' object has no attribute 'append'

In [34]:
import pandas as pd

df3 = pd.concat([df1, df2], ignore_index=True)  # Use ignore_index if you want a clean index
print(df3)

          A         B         C         D
0 -0.476490 -1.143196  1.749373  2.072065
1 -0.484795  0.029927  1.616818 -0.857582
2 -0.702967 -1.972064 -1.372123  0.040266
3  0.399794  0.084738  0.720785 -0.615648
4 -0.254511 -0.677559 -0.129793  1.649060
5  0.687133  0.135693  0.773587 -1.184200
6 -1.293331  0.586432  0.430087  0.190466
7 -1.099503 -1.250231  0.168092 -1.235777
8  1.063069  0.283184 -0.600711  1.679216
9  0.683213 -0.581257 -1.863775  0.791107